import React from 'react';
import './index.less';

export default function Version01(){
    return (
        <div className='version_con'>
            <h1>乐程主站Version1.0</h1>
            <h2>登录/注册</h2>
            <ul>
                <li>所有用户可见</li>
                <li>从首页导航栏可进入登录/注册页面.</li>
                <li>点击“登录/注册”可切换登录和注册功能，点击“LeCheng”可返回首页.</li>
            </ul>
            <h2>首页</h2>
            <ul>
                <li>所有用户可见.</li>
                <li>粗略展示了团队动态、发展方向、团队成果及友情链接等.</li>
                <li>第二屏展示了最近四条动态.</li>
                <li>第四屏点击了解更多进入团队简介页面.</li>
                <li>最后一屏右侧小菜单放了团队招新群号、群二维码及网站管理员的qq;可跳转顶部;友链处可提交反馈.</li>
                <li>登录后“登录/注册”切换为用户头像，点击头像进入个人空间.</li>
            </ul>
            <h2>个人空间</h2>
            <ul>
                <li>登录可见</li>
                <li>普通用户仅展示基本信息，点击头像下方“未认证”可提交认证，管理员通过认证后展示已认证图标.</li>
                <li>可完善个人信息，可修改密码，修改成功后跳转登录页面.</li>
                <li>团队成员除展示基本信息外，还显示目标和个人总结记录，可修改目标的完成状态.</li>
            </ul>
            <h2>团队简介</h2>
            <ul>
                <li>所有用户可见.</li>
                <li>此页详细描述了团队自创立以来的发展方向及、在各个方向上所取得的成果及团队团建等.</li>
                <li>点击“团队荣誉”下方的“乐程名人榜”可进入名人榜页面.</li>
                <li>点击左上角的图标可展开菜单，点击“乐程LeCheng”可跳转首页</li>
                <li>底部可匿名提交反馈信息，所有网站用户均可提交.</li>
            </ul>
            <h2>乐程名人榜</h2>
            <ul>
                <li>所有用户可见.</li>
                <li>此页主要展示了近几届部分学长学姐的近况、寄语等. 点击左侧菜单可切换年级;鼠标移入图片可查看文字描述.</li>
            </ul>
            <h2>团队相册</h2>
            <ul>
                <li>团队成员可见</li>
                <li>团队相册分团建、日常、音乐、团队荣誉、人物、运动等六个专区.</li>
                <li>移入鼠标，点击“View more”可进入相应相册.</li>
                <li>相册内部可从本地上传图片，图片可预览.</li>
            </ul>
            <h2>乐程墙</h2>
            <ul>
                <li>团队成员可见.</li>
                <li>点击“现在就写”可添加目标，点击“历史记录”可查看所有成员未完成的目标.点击头像可查看队员个人空间.</li>
                <li>总结部分，点击可查看总结详情,可添加评论.</li>
            </ul>
            <h2>奖惩信息</h2>
            <ul>
                <li>团队成员可见.</li>
                <li>顶部展示了团队规章制度.</li>
                <li>底部显示奖惩记录，可根据奖惩类别、年级、姓名搜索记录,其中姓名可模糊查询.</li>
            </ul>
            <h2>财务管理</h2>
            <ul>
                <li>团队成员可见</li>
                <li>此处分收入/支出、图形图表、数据管理三个子菜单，其中数据管理仅管理员可见.</li>
                <li>收入/支出:可按姓名、年级、交易类型、交易日期区间查询记录，姓名为模糊查询.</li>
                <li>图形图表:通过柱状图展示了月收入/支出、饼图展示总收入/支出/余额等信息.</li>
                <li>数据管理:在查询的基础上新增了添加和修改功能.</li>
            </ul>
            <h2>后台管理</h2>
            <ul>
                <li>仅管理员可见</li>
                <li>含查看反馈信息、用户管理、奖惩管理、名人榜管理、公告管理以及队员认证处理等.</li>
                <li>可查询，部分可添加、修改、删除.</li>
            </ul>
        </div>
    );
}