import React from 'react';

export default function Version02(){
    return (
        <div className='version_con'>
            <h1>乐程主站Version2.0</h1>
            <p>Version2.0完善了部分细节，添加了版本信息，新增了以下功能：</p>
            <h2>首页</h2>
            <ul>
                <li>历史动态处点击更多可查看所有历史记录.</li>
            </ul>
            <h2>成员列表</h2>
            <ul>
                <li>团队成员可见</li>
                <li>显示已认证团队成员人数、各年级人数、显示各年级团队成员列表.</li>
                <li>点击成员列表项可查看成员个人空间.</li>
                <li>按功能区分个人空间/他人空间</li>
            </ul>
            <h2>队员总结</h2>
            <ul>
                <li>在已有基础上新增浏览量、点赞、评论回复、点击头像进入空间等功能.</li>
                <li>写总结可添加多张图片.</li>
                <li>总结图片可预览，可左右切换.</li>
            </ul>
            <h2>后台管理</h2>
            <ul>
                <li>完善了名人榜的修改和删除功能.</li>
            </ul>
            <h2>财务管理</h2>
            <ul>
                <li>完善了柱状图展示每月数据</li>
            </ul>
            <h2>注*</h2>
            <ul>
                <li>没有上传头像的用户，首页导航栏处、空间显示默认头像，因为没有性别信息，
                    所以团队成员列表处默认显示可爱的小女孩头像，其余地方默认是别说批话,
                    大家看到不要以为是bug哈O(∩_∩)O哈哈~
                </li>
            </ul>
        </div>
    );
}